[해로, HAERO, 海路](https://velog.io/@haero_kim/SOLID-%EC%9B%90%EC%B9%99-%EC%96%B4%EB%A0%B5%EC%A7%80-%EC%95%8A%EB%8B%A4)

[위키피디아](https://ko.m.wikipedia.org/wiki/SOLID_(%EA%B0%9D%EC%B2%B4_%EC%A7%80%ED%96%A5_%EC%84%A4%EA%B3%84))

[La.place 님 블로그](https://dev-momo.tistory.com/entry/SOLID-%EC%9B%90%EC%B9%99)

해당 글들을 참고했습니다.

# 객체지향 설계원칙 (SOLID)

## 1. SRP (Single Responsibility) 단일 책임 원칙

"한 클래스는 하나의 책임만 가져야 한다."

- 클래스는 단 한개의 책임을 가져야합니다.
- 클래스를 변경하는 이유는 단 하나여야 합니다.
- 이를 지키지 않을 시, 한 책임의 변경에 의해 다른 책임과 관련된 코드에 영향을 미칠 수 있습니다.

## 2. OCP (Open-Closed)  개방-폐쇄 원칙

"소프트웨어 요소는 확장에는 열려 있으나 변경에는 닫혀있어야 한다."

- 기존 코드를 변경하지 않고 기능을 수정하거나 추가할 수 있도록 설계해야함.

어떤 모듈의 기능을 하나 수정할 때, 그 모듈을 이용하는 다른 모듈을 줄줄이 수정해야한다면, 유지보수가 복잡할 것이다.

## 3. LSP (Liskov Substitution) 리스코프 치환 원칙

"프로그램의 객체는 프로그램의 정확성을 깨뜨리지 않으면서 하위 타입의 인스턴스로 바꿀 수 있어야 한다."

- 자식 클래스는 부모클래스에서 가능한 행위를 수행할 수 있어야 한다.

상속관계에서는 일반화 관계 (IS - A) 가 성립해야 한다. 일반화 관계에 있다는 것은 일관성이 있따는 것이다.

ex) 도형 클래스와 사각형 클래스
**사각형 클래스는 도형 클래스의 상속을 받는다**

1. 도형은 둘레를 가지고 있다.
2. 도형은 넓이를 가지고 있다.
3. 도형은 각을 가지고 있다.

여기서 도형이 만약 원이라고 생각한다면, 문제가 된다.

3. 원은 각을 가지고 있다.

3번 문장이 어색해 지는 것이다.

따라서 도형 클래스는 LSP를 만족하지 않은 설계이다.

## 4. ISP (Interface Segregation) 인터페이스 분리 원칙

"특정 클라이언트를 위한 인터페이스 여러 개가 범용 인터페이스 하나 보다 낫다."




## 5. DIP (Dependency Inversion) 의존 역전 원칙

프로그래머는 "추상화에 의존해야지, 구체화의 의존하면 안된다."s

- 의존 관계를 맺을 때, 변하기 쉬운 것 (구체적인 것) 보다는 변하기 어려운 것 (추상적인 것)에 의존해야 함.

> 구체화된 클래스에 의존하기 보다는 추상 클래스나 인터페이스에 의존해야한다는 뜻

## 정리

SRP와 ISP 는 객체가 커지는 것을 막아준다.

LSP와 DIP는 OCP 를 서포트 한다.
